Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དམིགས་པར་ལྟ་བ་བདག་ལ་ཆགས་པ་རྣམས།
en: Those who were fixated on objects and were attached to a self

source: །དེ་དག་དགེ་སློང་ཅི་སྨྲ་མོས་མི་བྱེད།
en: Did not approve of the bhikṣu’s teaching. {54} “Those bhikṣus rose up and took up weapons,

source: །སུ་དག་སྟོང་པ་ཞི་བ་མི་འདོད་པ།
en: As they did not approve of emptiness and peace.

source: །དགེ་སློང་འདི་ནི་ཆོས་མིན་རབ་སྟོན་གྱིས།
en: They said, ‘What this bhikṣu is teaching is not the Dharma,

source: །འདི་བསད་ན་ནི་བསོད་ནམས་འགྱུར་ཞེས་ནས། །དགེ་སློང་དག་ནི་ལག་ན་མཚོན་ཐོགས་འོངས།
en: It will be meritorious if we kill him.’ {55}

source: །མཐོང་ནས་དགེ་སློང་མཚོན་གྱིས་མི་འཇིགས་ཏེ།
en: “The bhikṣu was not afraid when he saw their weapons. He was aware of the emptiness of phenomena,

source: །འདི་ལ་སེམས་ཅན་སྐྱེས་བུ་གསོད་པ་མེད།
en: That there was no being or man there to be killed,

source: །ཆོས་འདི་རྣམས་ནི་གསོག་སྟེ་རྩིག་པ་འདྲ། །སྟོང་པ་ཉིད་ཀྱི་ཆོས་རྣམས་རྗེས་སུ་དྲན།
en: That these phenomena were as insubstantial as plaster. {56}

source: །དགེ་སློང་དེས་ནི་སྤྱི་བོར་ཐལ་སྦྱར་ཏེ།
en: “The bhikṣu placed his hands together upon his head

source: །ཚིག་སྨྲས་རྒྱལ་བ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: And spoke these words of homage to the jinas:

source: །བདེན་པ་གང་གིས་ཆོས་འདི་སྟོང་པ་ན།
en: ‘Through the truth of the emptiness of phenomena

source: །མཚོན་ཆ་འདི་རྣམས་མེ་ཏོག་མན་དཱར་གྱུར།
en: May these weapons become coral tree flowers!’ {57}

source: །ཐུབ་པ་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་ལྡན་པ་ཡིས།
en: “He possessed the conduct and discipline of the Sage

source: །གཞན་དུ་མི་འགྱུར་ཚིག་འདི་སྨྲས་མ་ཐག །ནགས་ཚལ་བཅས་པའི་ས་ཡང་རབ་ཏུ་གཡོས།
en: And as soon as he spoke those words and no others, The earth and its forests shook

source: །མཚོན་ཆ་དེ་དག་མེ་ཏོག་མན་དཱར་གྱུར།
en: And the weapons became coral tree flowers. {58} “At that time, the bhikṣus who believed in objective reality

source: །དམིགས་པ་ཅན་དག་མཚོན་ཆ་ཐོགས་པ་ཡི། །དགེ་སློང་དེ་ཚེ་ལུས་ནི་ཞུམ་གྱུར་ནས།
en: And who were holding weapons became ill-shaped in body.

source: །ཚུར་ཡང་དེ་ནས་ཉེ་བར་འོང་མ་ནུས།
en: They could not approach any nearer

source: །སྐྲག་ཅིང་ཤིན་ཏུ་ངོ་མཚར་ཆེན་པོར་གྱུར།
en: And became frightened and greatly amazed. {59}

source: །སུ་དག་ཐུབ་དབང་ལ་ནི་དད་མོས་ཤིང་།
en: “Those who had faith and trust in the Lord of sages,

source: །གང་དག་སྟོང་པ་ཞི་བ་འདོད་པ་རྣམས།
en: Those who delighted in emptiness and peace,

source: །དེ་དག་ཨ་ལ་ལ་སྟོང་བརྗོད་ནས་སུ།
en: They cried out ‘A la la!’ a thousand times,

source: །རས་བཅོས་བརྒྱ་ཡིས་དགེ་སློང་མངོན་པར་གཡོགས།
en: And presented the bhikṣu with hundreds of lengths of cloth. {60}

source: །དགེ་སློང་དེ་ནི་དེ་ལ་བྱམས་བསྐྱེད་ནས།
en: “The bhikṣu had love for them And said to all the people before him, ‘I will practice bodhisattva conduct

source: །སེམས་ཅན་སུ་དག་ང་ལ་སྡང་བྱེད་པ། །དེ་དག་ཕྱིར་ནི་བྱང་ཆུབ་བདག་སྤྱོད་ཅེས། །སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ཡང་མདུན་དུ་སྨྲ།
en: For the sake of those beings who are angry with me.’ {61}

source: །དེས་ནི་ལོ་ཡང་བརྒྱད་ཅུ་མི་ཉུང་བར།
en: “Then for no fewer than eighty years

source: །སྟོང་པ་རྒྱལ་བ་རྣམས་ཀྱི་མཛོད་བཤད་དེ།
en: He taught emptiness, the treasure of the jinas. And the son of the king protected him

source: །ཕྱིར་རྒོལ་བ་ཡང་དགེ་སློང་སྟོང་དག་བྱུང་། །དེ་དག་རྒྱལ་པོའི་བུ་ཡིས་ཕྱིར་བཟློག་བྱས།
en: From the thousands of bhikṣus who were his adversaries. {62}

source: །དེ་ཡང་དེ་ཚེ་ཡོངས་སུ་བརྙས་གྱུར་ཏེ།
en: “During that time he was despised,

source: །དེ་ཡི་དགེ་སློང་དག་ཀྱང་ཉུང་བར་གྱུར།
en: And his bhikṣus became few in number.

source: །དེ་ཚེ་མི་སྙན་པ་ཡི་ཚིག་ཐོས་ཀྱང་།
en: Evil things were heard said about him,

source: །བཟོད་པའི་སྟོབས་ལས་ནམ་ཡང་ཉམས་མ་གྱུར།
en: But the power of his patience never declined. {63}

source: །དེ་ནི་གཞན་གྱི་དུས་སུ་གྱུར་པའི་ཚེ།
en: “Then at another time he accomplished

source: །སྲོག་ཆགས་བརྒྱ་དག་གི་ཡང་དོན་ཆེན་བྱས།
en: A great benefit for hundreds of beings.

source: །བསམ་གྱིས་མི་ཁྱབ་ཆོས་ཀྱང་རྗེས་སུ་དྲན།
en: He recollected countless Dharma teachings

source: །བསོད་ནམས་བློ་གྲོས་དགའ་བ་ཆེན་པོ་སྐྱེས།
en: And at that time Puṇyamatin felt great joy. {64}

source: །དེར་ཡང་རི་མོ་རྒྱ་ཆེར་བྱས་ནས་ནི།
en: “He respectfully honored the bhikṣu

source: །དགེ་སློང་དེ་ལ་བསོད་ནམས་བློ་གྲོས་སྨྲས།
en: And then Puṇyamatin said to him,

source: །བདག་གི་སློབ་དཔོན་ལ་ནི་སུ་ཡིས་ཀྱང་།
en: ‘No one at all should do anything

source: །སེམས་ལ་མི་འཐད་ཅི་ཞིག་མ་བགྱིས་སམ།
en: That is displeasing to my teacher.’ {65}

source: །དེས་སྨྲས་རྒྱལ་སྲས་གཞོན་ནུ་གསན་དུ་གསོལ།
en: “He replied, ‘Young prince, listen to me.

source: །བཟོད་པའི་སྟོབས་ཀྱིས་སངས་རྒྱས་ཡང་དག་བྱུང་།
en: It is through the power of patience that buddhas appear.

source: །སུ་ཡིས་བདག་ལ་མི་སྙན་ཚིག་སྨྲས་པ།
en: When someone speaks unpleasantly to me,

source: །དེ་ལ་བདག་ནི་བྱམས་པ་རྒྱ་ཡང་ཆེ།
en: Toward him I feel a great love.’ {66} “I was that bhikṣu Yaśaḥprabha,

source: །གང་གིས་བསྐལ་པ་སྟོང་ཕྲག་བརྒྱ་དག་ཏུ། །སྔོན་གྱི་སྲིད་པ་ལ་ནི་བཟོད་བསྒོམས་པ། །དགེ་སློང་སྙན་འོད་དེ་ནི་ང་ཡིན་ཞེས།
en: Who meditated on patience in previous lives Throughout a hundred thousand eons.”

source: །བཅོམ་ལྡན་ཤཱཀྱ་ཐུབ་པས་ཚིག་བརྗོད་དོ།
en: Those were the words Bhagavān Śākyamuni spoke. {67} “The prince Puṇyamatin, who was

source: །གང་གིས་དགེ་སློང་སྙན་འོད་བསྲུངས་པ་ཡི། །བསོད་ནམས་བློ་གྲོས་རྒྱལ་པོའི་བུ་དེ་ནི།
en: The protector of Bhikṣu Yaśaḥprabha,

source: །ཚེ་རབས་སྟོང་དུ་ང་ཡི་གྲོགས་གྱུར་ཏེ།
en: Has been my companion in thousands of lifetimes,

source: །སངས་རྒྱས་བྱམས་པར་ངས་ནི་ལུང་བསྟན་ཏོ།
en: And I prophesy that he will be Buddha Maitreya. {68}

source: །གང་གིས་སྟོན་པ་ཚོགས་ཀྱི་དབང་ཕྱུག་མཆོད།
en: “The one who made offerings to the teacher Gaṇeśvara,

source: །གང་གིས་གནས་ཁང་བཟང་པོ་མཆོག་བྱས་པ།
en: The one who had built a perfect monastery,

source: །གང་སྔོན་མེ་ཏོག་བཟང་ཞེས་བྱ་བ་དེ།
en: The one who was previously known as Varapuṣpasa

source: །རྐང་གཉིས་གཙོ་བོ་མི་ཡི་དབང་པོར་གྱུར།
en: Became the Lord of humans Padmottara. {69}

source: །དེ་ལྟར་བསྐལ་པ་མང་པོ་མཐའ་ཡས་པར།
en: “In that way, for many endless eons

source: །རྒྱལ་བ་དག་གི་དམ་ཆོས་ངས་བཟུང་སྟེ།
en: I held the Dharma of the jinas.

source: །ངས་སྔོན་བཟོད་པའི་སྟོབས་ཀྱང་ཡང་དག་བསྒྲུབས།
en: In the past, I accomplished the power of patience.

source: །གཞོན་ནུ་ཐོས་ནས་ང་ཡི་རྗེས་སུ་སློབས།
en: Young man, having heard this, follow my example. {70}

source: །ང་ནི་མྱ་ངན་འདས་གྱུར་ཕྱི་མའི་ཚེ།
en: “After I have passed into nirvāṇa, in future times

source: །དམ་པའི་ཆོས་ནི་རྣམ་པར་འཇིག་པ་ན།
en: When the Dharma is being destroyed

source: །དགེ་སློང་མུ་སྟེགས་བློ་ལ་བརྩོན་པ་དག །དེ་དག་ང་ཡི་ཞི་བའི་ཆོས་ལ་སྤོང་།
en: Bhikṣus will follow the thoughts of tīrthikas And will forsake my Dharma of peace. {71}

source: །ཁེངས་ཤིང་རྒོད་ལ་གཏུམ་ཞིང་སྤྱི་བརྟོལ་ཆེ།
en: “They will be arrogant, conceited, wicked, and reckless.

source: །སྡིག་པའི་གྲོགས་པོའི་ཟས་ལ་ཆགས་པ་དག །ཆོས་གོས་ལྷུང་བཟེད་དག་ལ་ཆགས་ཤིང་བརྐམ།
en: They will associate with sinners and be greedy for food. They will be attached to their robes and alms bowls, greedy for cloth,

source: །རྙེད་ལ་གནས་ཤིང་དེ་དག་ཆོས་ལ་སྤོང་།
en: And be devoted to acquisition and forsake the Dharma. {72}

source: །དེ་དག་ཡིད་གཏུམ་ཞེ་སྡང་བྱས་མི་གཟོ།
en: “They will be aggressive, fierce, and ungrateful.

source: །དམའ་བའི་རིགས་དང་དབུལ་བའི་རིགས་ལས་ནི།
en: They will come from vile families, poor families,

source: །ང་ཡི་བསྟན་པ་འདི་ལ་རབ་བྱུང་ནས།
en: Enter homelessness within my teaching

source: །དེ་དག་ཞི་བའི་ཆོས་འདི་སྤོང་བར་བྱེད།
en: And will reject the Dharma of peace. {73}

source: །བདུད་ཀྱི་བློ་ཡིས་སེམས་ཅན་མུན་གཏིབས་ཤིང་།
en: “They will have Māra’s thoughts and will be beings in darkness.

source: །འདོད་ཆགས་དབང་དུ་སོང་བས་མངོན་པར་ཆགས།
en: They will be under the power of desire and have strong attachment.

source: །གཏི་མུག་དབང་གིས་བྱིས་པ་རྨོངས་པས་ན།
en: They will be under the power of ignorance and be ignorant fools,

source: །དེ་དག་སྟོང་པ་ཞི་བའི་ཆོས་མི་འདོད།
en: And they will not delight in the Dharma of emptiness and peace. {74}

source: །དགེ་སློང་དགེ་སློང་མ་དང་ཁྱིམ་པ་རྣམས།
en: “The bhikṣus, bhikṣuṇīs, and laypeople,

source: །སྡིག་པའི་བློ་ཡིས་འཛིན་བཅུག་རྨོངས་བྱས་ཏེ།
en: With wicked minds, will be avaricious and stupid.

source: །དེ་དག་དབང་དུ་རྟག་པར་སོང་གྱུར་པས།
en: They will always become overpowered in that way,

source: །ཕྱི་མའི་དུས་ལ་བྱང་ཆུབ་སྤོང་བར་བྱེད།
en: And in the later times they will reject enlightenment. {75}

source: །ང་ཡི་ཚིག་འདི་གཞོན་ནུ་ཐོས་ནས་སུ།
en: “Listen, young man, to these my words.

source: །དགེ་སློང་དགོན་པ་པ་དག་རྟག་ཏུ་སྟེན།
en: A bhikṣu should always dwell in solitude.

source: །སུ་དག་སྟོང་པ་ཞི་ལ་དགའ་བ་ནི།
en: Those who long for peace and emptiness

source: །དེ་དག་རྒྱལ་བའི་ཆོས་འདི་བཟུང་བ་ཡིན།
en: Should possess this Dharma of the jinas. {76}

source: །སུ་དག་ཏིང་འཛིན་འདི་ནི་འཛིན་གྱུར་པ།
en: “The one who possesses this samādhi

source: །དེ་དག་ང་ཡི་བསྟན་ལ་རབ་བྱུང་ཞིང་།
en: Has practiced homelessness in my teaching,

source: །དགེ་སློང་བསྙེན་རྫོགས་གསོ་སྦྱོང་ལས་རྣམས་བྱས།
en: Is ordained as a bhikṣu and practices poṣadha,

source: །ཟས་ལ་མི་ཆགས་མི་བརྐམ་ཟ་བ་ཡིན།
en: And eats free of craving, without attachment to food. {77}

source: །ལུས་དང་སྲོག་ལ་ལྟ་བ་རབ་སྤངས་ལ།
en: “Forsaking all concern for life and body,

source: །སྟོང་པ་ཤིན་ཏུ་ཞི་བ་སྒོམ་པར་གྱིས།
en: Meditate on emptiness, upon perfect peace.

source: །བརྩོན་ཞིང་རབ་ཏུ་བརྩོན་པའི་ཡིད་ཀྱིས་ཀྱང་།
en: Meditating with dedication, complete dedication.

source: །རི་དགས་བཞིན་དུ་དགོན་པར་གནས་པར་གྱིས།
en: Like a deer, live always in the forests. {78}

source: །རྒྱལ་བ་དག་ལ་རྟག་ཏུ་མཆོད་པ་གྱིས།
en: “Always make offerings to the jinas

source: །གདུགས་དང་རྒྱལ་མཚན་བསྒྲེང་བ་གནས་ཁང་གིས།
en: With parasols, banners, and with dwellings.

source: །བདེ་བར་གཤེགས་པའི་མཆོད་རྟེན་མཆོད་པར་གྱིས།
en: Make offerings to stūpas of the sugatas

source: །ཏིང་འཛིན་འདི་ནི་མྱུར་དུ་ཐོབ་པར་འགྱུར། །བྱང་ཆུབ་ཕྱིར་ནི་སེམས་ཀྱང་སྐྱེད་གྱིས་ལ།
en: And quickly attain this samādhi. {79} “Develop the aspiration for the state of enlightenment.

source: །བདེ་བར་གཤེགས་པ་རྣམས་ཀྱི་མཆོད་རྟེན་དག །གསེར་གྱིས་བརྒྱན་ཅིང་དངུལ་གྱིས་བསྐུས་པ་དང་། །རིན་ཆེན་སྣ་ཚོགས་གཟུགས་ལེགས་བྱེད་དུ་ཆུག །བྱང་ཆུབ་ཕྱིར་ནི་ཡི་དམ་བཅའ་གྱིས་ལ།
en: Beautify the stūpas of the sugatas, Adorning them with gold and covering them with silver, And have beautiful images from precious materials made. {80} “Make a commitment to attain enlightenment

source: །འཇིག་རྟེན་མཆོད་པ་བཟང་པོ་ཇི་སྙེད་པ།
en: And make all the good offerings that there are in the world,

source: །ལྷ་དང་མི་ཡི་དགའ་བར་འགྱུར་བ་རྣམས། ཐམས་ཅད་ཚོལ་ལ་སངས་རྒྱས་མཆོད་པ་གྱིས།
en: Of all that is pleasing to devas and humans, And honor the buddhas with desirable offerings. {81}

source: །ཆོས་ཉིད་དུ་ཡང་མི་དབང་ཐམས་ཅད་ལྟོས།
en: “See as the true nature, too, all the lords of humans;

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ན་གང་བཞུགས་དང་། །རྒྱལ་བ་མྱ་ངན་འདས་པ་ཀུན་སྣང་སྟེ།
en: For within the worlds in all ten directions, The jinas who are present and those who have passed away

source: །ཆོས་ཉིད་ཀྱིས་ནི་སངས་རྒྱས་མངོན་སུམ་བཞུགས།
en: Have come to be buddhas through the true nature. {82}

source: །གཏོང་བ་ཀུན་ལ་ཤིན་ཏུ་མོས་པར་གྱིས།
en: “Have the aspiration to be generous to all.

source: །ཚུལ་ཁྲིམས་དག་པར་གྱུར་ཅིང་བརྟན་པའི་སེམས།
en: Have pure conduct and a stable mind.

source: །བཟོད་ལ་དགའ་ཞིང་རྟག་ཏུ་བྱམས་ལ་དགའ།
en: Delight in patience and always delight in kindness,

source: །ཆོས་རྣམས་ཐམས་ཅད་སྟོང་པར་ཤེས་པར་གྱིས།
en: And know that all phenomena are empty. {83}

source: །མ་ཞུམ་མ་འགོང་བརྩོན་འགྲུས་རབ་སྐྱེད་ལ།
en: “Develop diligence confidently and fearlessly.

source: །བསམ་གཏན་དགའ་ཞིང་རབ་ཏུ་དབེན་ལ་མོས།
en: Delight in dhyāna and delight in solitude.

source: །ཤེས་རབ་རྣམ་དག་ཤེས་རབ་རབ་ཤེས་ཀྱིས།
en: Develop wisdom, completely pure wisdom,

source: །རིང་པོར་མི་ཐོགས་སྙིང་རྗེ་ལྡན་པར་འགྱུར།
en: And quickly become compassionate. {84}

source: །མི་གཙང་བས་ནི་འདོད་ཆགས་རྟག་ཞི་གྱིས།
en: “Always pacify desire through contemplating ugliness,

source: །བཟོད་པའི་སྟོབས་ཀྱིས་ཞེ་སྡང་ཚར་ཆོད་ཅིག །ཤེས་རབ་སྟོབས་ཀྱིས་གཏི་མུག་བསལ་བར་གྱིས།
en: Overcome anger with the power of patience, Overcome ignorance with the power of wisdom,

source: །རྒྱལ་བས་བསྔགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར།
en: And attain the enlightenment praised by the jinas. {85}

source: །ལུས་ནི་སྙིང་པོ་མེད་ཅིང་དབུ་བ་འདྲ།
en: “The body has no essence; it is like foam.

source: །སྡུག་བསྔལ་རུལ་བ་དྲི་ང་བསྒོམ་པར་གྱིས།
en: It creates suffering, and is putrid and foul smelling.

source: །ཕུང་པོ་ཐམས་ཅད་གསོག་ཏུ་ཤེས་པར་གྱིས།
en: Know all aggregates to be insubstantial

source: །ཡེ་ཤེས་བླ་མེད་མྱུར་དུ་ཐོབ་པར་འགྱུར།
en: And quickly attain the highest wisdom. {86} “Never hold views that give rise to bad actions:

source: །བདག་དང་སྐྱེས་བུ་དང་ནི་སྲོག་རྣམས་སུ།
en: That there is a self, an individual, and a soul.

source: །སྡིག་པའི་ལྟ་བ་ནམ་ཡང་མ་འཛིན་ཅིག །ཆོས་རྣམས་ཐམས་ཅད་སྟོང་པར་ཤེས་པར་གྱིས།
en: Know that all phenomena are empty

source: །བླ་མེད་བྱང་ཆུབ་མྱུར་དུ་རེག་པར་འགྱུར།
en: And quickly reach the highest enlightenment. {87}

source: །རྙེད་ལ་ཆགས་པར་ནམ་ཡང་མ་བྱེད་ཅིག །ཟས་རྣམས་མ་རྙེད་ན་ཡང་གདུང་མ་བྱེད།
en: “Never have yearning for possessions. Do not be distressed if you do not obtain alms,

source: །བསྟོད་དང་སྨད་པ་དག་གིས་མ་གཡོ་བར།
en: Be unmoved by praise or blame,

source: །རི་རབ་བཞིན་དུ་རབ་ཏུ་མི་འགུལ་གྱིས།
en: And be as unshakable as Mount Meru. {88}

source: །གུས་པ་སྐྱེད་ལ་ཆོས་རྣམས་བཙལ་བར་གྱིས།
en: “With veneration seek the Dharma;

source: །ཐོས་ནས་དེ་ཚེ་དེ་ཡང་མྱོང་བར་གྱིས།
en: Having heard it then become that.

source: །རྒྱལ་བ་ཀུན་གྱི་སྤྱོད་ཡུལ་གནས་གྱིས་དང་། །བདེ་བ་ཅན་གྱི་ཞིང་དུ་མྱུར་དུ་འགྲོ།
en: Maintain the conduct of the jinas And quickly go to the realm of Sukhāvatī. {89}

source: །འགྲོ་བ་ཀུན་ལ་སེམས་ཀྱང་མཉམ་གྱིས་ལ།
en: “Be even-minded toward all beings.

source: །སྡུག་དང་མི་སྡུག་པ་ཡི་སེམས་མ་བྱེད།
en: Do not have likes or dislikes in your mind.

source: །རྙེད་དང་སྙན་པ་དག་ནི་མ་ཚོལ་ཅིག །མྱུར་དུ་སངས་རྒྱས་ཐུབ་པའི་དབང་པོར་འགྱུར།
en: Do not long for gain and fame, And quickly become a buddha, a lord of sages. {90} “Always describe the qualities of the buddhas Correctly through their definitions,

source: །ཡོན་ཏན་གང་ཐོས་སེམས་ཅན་དད་འགྱུར་ཞིང་།
en: So that the beings who hear about the qualities will have faith

source: །སངས་རྒྱས་ཡོན་ཏན་དག་ལ་མོས་སྐྱེད་པ། །ཡང་དག་ཡོན་ཏན་ངེས་པའི་ཚིག་རྣམས་ཀྱིས། །སངས་རྒྱས་ཡོན་ཏན་རྟག་ཏུ་བཤད་པར་གྱིས།
en: And you cause them to aspire to the qualities of a buddha. {91}

source: །རྟག་ཏུ་སློབ་དཔོན་དང་ནི་ཕ་དང་མ། །དེ་བཞིན་འགྲོ་བ་ཀུན་ལ་གུས་པར་གྱིས།
en: “Always venerate your teacher, Your parents, and similarly all beings.

source: །ང་རྒྱལ་དག་གི་དབང་དུ་མ་འགྲོ་ཤིག །སུམ་ཅུ་རྩ་གཉིས་མཚན་རྣམས་ཐོབ་པར་འགྱུར།
en: Do not fall under the power of pride, And attain the thirty-two signs of a great being. {92}

source: །འདུ་འཛི་དག་ནི་མ་ལུས་རྣམ་སྤངས་ནས།
en: “Avoid all crowds without exception,

source: །རྟག་ཏུ་དབེན་པ་ལ་ཡང་དགའ་བར་གྱིས།
en: And always delight in solitude.

source: །དེས་ཤིང་བརྟུལ་ཞུགས་བཟང་ལ་རྟག་ཏུ་ཞི།
en: Always be pleasant, disciplined, and peaceful.

source: །བདག་ལ་ཕན་ཞིང་སེམས་ཅན་གཞན་ལ་ཕན།
en: Be beneficial for yourself and beneficial to other beings. {93}

source: །བྱམས་པ་དང་ནི་སྙིང་རྗེ་བསྒོམ་པར་གྱིས།
en: “Cultivate kindness and compassion,

source: །དགའ་དང་བཏང་སྙོམས་ལ་ཡང་རྟག་མོས་གྱིས།
en: And always aspire to rejoicing and equanimity.

source: །རྟག་ཏུ་རྒྱལ་བའི་བསྟན་པ་རྗེས་སུ་ལྟོས།
en: Always follow the teaching of the jinas

source: །འཇིག་རྟེན་དུ་ཡང་མྱུར་དུ་ཕན་བྱེད་འགྱུར།
en: And quickly become one who benefits the world. {94}

source: །སྡིག་པའི་གྲོགས་པོ་ནམ་ཡང་མ་སྟེན་པར།
en: “Never gain wicked friends;

source: །གྲོགས་པོ་གང་དག་རྒྱ་ཆེར་སྟེན་པར་གྱིས།
en: Have friends who are noble.

source: །སུ་དག་སྟོང་པ་ཞི་བ་འདི་འདོད་པ།
en: Those who long for emptiness and peace

source: །དེ་དག་བྱང་ཆུབ་མཆོག་ལ་ཞུགས་པ་ཡིན།
en: Are established in the path to supreme enlightenment. {95}

source: །ཉན་ཐོས་སར་ནི་ནམ་ཡང་མ་སློབ་ཤིག །དེ་ཡི་སྤྱོད་ལའང་དགའ་བར་མ་བྱེད་ཅིག །སངས་རྒྱས་ཡོན་ཏན་དག་ལས་སེམས་མ་བཏང་།
en: “Do not train on the level of the śrāvakas, And do not delight in their practice. Do not turn your mind away from the buddha qualities

source: །མྱུར་དུ་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོར་འགྱུར།
en: And quickly become a buddha, a lord of jinas. {96}

source: །བདེན་ཚིག་དམ་པ་རྟག་ཏུ་སྨྲ་བར་གྱིས།
en: “Always speak pure, true words.

source: །བརྫུན་རྣམས་དང་ནི་རྩུབ་པོའི་ཚིག་མ་སྨྲ།
en: Do not speak harshly or tell lies.

source: །རྟག་ཏུ་འཇམ་ཞིང་དགའ་བ་སྨྲ་བར་གྱིས།
en: Always speak gently and pleasantly

source: །འཇིག་རྟེན་སློབ་དཔོན་དག་གི་གསུང་ཐོབ་འགྱུར།
en: And obtain the speech of the world’s teacher. {97}

source: །ལུས་དང་སྲོག་ལ་ཆགས་པར་མ་བྱེད་ཅིག །གཞན་ལ་སྨོད་ཅིང་བདག་ལ་སྟོད་མ་བྱེད།
en: “Do not be concerned with your life and body. Do not criticize others and praise yourself.

source: །བདག་གི་ཡོན་ཏན་ཡང་དག་སྒྲུབ་གྱིས་ལ།
en: Accomplish your own good qualities

source: །གཞན་གྱི་སྤྱོད་པ་དག་ལ་བཏང་སྙོམས་གྱིས།
en: And have equanimity toward the conduct of others. {98}

source: །རྣམ་ཐར་སྟོང་ལ་རྟག་ཏུ་དགའ་བར་གྱིས།
en: “Always delight in the liberations and emptiness.

source: །འགྲོ་བ་རྣམས་སུ་སྨོན་པར་མ་བྱེད་ཅིག །མཚན་མ་ཐམས་ཅད་མ་ལུས་རྣམ་པར་སྤོངས།
en: Do not make prayers for rebirth in the realms of beings. Abandon all concepts without exception

source: །རྟག་ཏུ་མཚན་མ་མེད་ལ་གནས་པར་གྱིས།
en: And always abide in a state without concepts. {99}

source: །དུས་ཀུན་ཏུ་ནི་མཐའ་ཡང་རྣམ་པར་སྤོངས།
en: “Reject the extremes at all times.

source: །རྟག་དང་ཆད་ལ་གནས་པར་མ་གྱུར་ཅིག །ཐམས་ཅད་རྐྱེན་ལས་གྱུར་པར་རྟག་རིག་གྱིས།
en: Do not follow nihilism or eternalism. Always know that everything is dependent,

source: །དེ་ལྟར་བྱས་ན་སྟོན་པ་ཇི་བཞིན་འགྱུར།
en: And in that way become such a teacher. {100}

source: །འདོད་པའི་དགའ་བ་རྣམས་ལ་དགའ་བ་སྤོངས།
en: “Reject delighting in the pleasures of desires,

source: །ཞེ་སྡང་ཐ་བ་དྲི་མ་རྣམ་སྤངས་ཤིང་།
en: Reject the stains of rigid anger,

source: །གཏི་མུག་མུན་པ་ཐམས་ཅད་རྣམ་བསལ་ན།
en: Reject all the darkness of ignorance,

source: །ཞི་བར་དགའ་བའི་མི་ཡི་སེང་གེར་འགྱུར།
en: And become a lion among men, delighting in peace. {101}

source: །རྟག་པ་མི་རྟག་པར་ཡང་རྟག་ཏུ་ལྟོས།
en: “Always see that the permanent is impermanent.

source: །སྲིད་པ་ཀུན་གྱི་སྡུག་བསྔལ་བདེ་གྲོལ་ཞིང་།
en: Be liberated from the happiness and suffering of all existences.

source: །བདག་དང་གཙང་ལ་མི་གཙང་བདག་མེད་པར།
en: See that self and purity are nonself and impure.

source: །བསྒོམ་པར་བྱས་ན་མི་ཡི་དབང་པོར་འགྱུར།
en: Meditate and become a lord of men. {102}

source: །འཇིག་རྟེན་སྒྲོན་མཛད་རྒྱལ་བ་རྣམས་ཀྱིས་ནི།
en: “The jinas, the lamps for the world,

source: །གང་ལ་ཚུལ་བཞིན་ཆོས་རྣམས་རབ་བསྟན་པ།
en: Taught whatever Dharma would be beneficial.

source: །དེ་ཡིས་བདུད་ཀྱི་སྟོབས་རྣམས་བཅོམ་ནས་སུ།
en: They defeated the armies of the māras

source: །བླ་ན་མེད་པའི་བྱང་ཆུབ་ཡངས་པ་ཐོབ།
en: And attained the supreme, highest enlightenment. {103}

source: །ཡོན་ཏན་ཇི་སྙེད་ངས་བཤད་ཐོབ་བྱས་ཏེ།
en: “I have taught the good qualities that there are

source: །ཉེས་པ་བརྒྱ་དག་ངས་ནི་གང་བསྟན་པ།
en: And described hundreds of faults.

source: །རྣམ་པར་སྤངས་ནས་སློབ་པར་བྱེད་པ་ནི།
en: Reject the faults and practice the qualities.

source: །གཞོན་ནུ་དེ་ཚེ་འདིར་ཡང་སངས་རྒྱས་འགྱུར།
en: Then, young man, in this life you will become a buddha.” {104}

source: །སྙན་པའི་འོད་ཀྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བརྒྱད་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ།
en: Conclusion of the thirty-eighth chapter, “Yaśaḥprabha.”

source: བམ་པོ་བཅུ་བཞི་པ།
en: Restraint of the Body, Speech, and Mind Chapter 39

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། དེ་ལྟ་བས་ན་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པས་བསྡམ་པར་བྱའོ་ཞེས་གཞོན་ནུ་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, you should train by thinking, ‘I shall have self-control through physical restraint.’

source: །གཞོན་ནུ་དེ་ལ་ལུས་ཀྱི་སྡོམ་པ་གང་ཞེ་ན། །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས།
en: “Young man, what is meant by physical restraint?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པར་འགྱུར་བ་དེ་ནི་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: That which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas are free of attachment to all phenomena.

source: །གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་འཐོབ་པར་འགྱུར་བ་དེ་ནི་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the thirty-two primary signs of a great being.

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་འཐོབ་པར་འགྱུར་བ་དེ་ནི་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: “That which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the eighty secondary signs of a great being.

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོབས་བཅུ་འཐོབ་པ་དང་། མི་འཇིགས་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་འཐོབ་པར་འགྱུར་བ་འདི་ནི།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the ten strengths, the four fearlessnesses, and the eighteen distinct qualities of a buddha.

source: གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ། །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་འཐོབ་སྟེ།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the three doorways to liberation.

source: །གསུམ་གང་ཞེ་ན་འདི་ལྟ་སྟེ།
en: What are these three?

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་འདི་གསུམ་འཐོབ་པར་འགྱུར་བ་འདི་ནི་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are emptiness, the absence of attributes, and the absence of aspiration. They attain those three doorways to liberation. “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the four great brahmavihāras.

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚངས་པའི་གནས་པ་ཆེན་པོ་བཞི་འཐོབ་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the four great brahmavihāras?

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། ཚངས་པའི་གནས་པ་ཆེན་པོ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are great love, great compassion, great joy, and great equanimity. They attain those four great brahmavihāras.

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་འཐོབ་སྟེ།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the four discernments.

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་འདི་བཞི་འཐོབ་པར་འགྱུར་བ་དེ་ནི་གཞོན་ནུ་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are the discernment of meaning, the discernment of phenomena, the discernment of definitions, and the discernment of eloquence. They attain those four discernments.

source: །ལུས་ཀྱི་སྡོམ་པ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་འཐོབ་སྟེ།
en: “Young man, that which is called ‘physical restraint’ is the physical restraint through which bodhisattva mahāsattvas attain the thirty-seven aspects of enlightenment.

source: སུམ་ཅུ་རྩ་བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the thirty-seven aspects of enlightenment?

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་འཐོབ་པར་འགྱུར་བ་དེ་ནི་ལུས་ཀྱི་སྡོམ་པ་ཞེས་བྱའོ།
en: They are the four kinds of mindfulness, the four correct exertions, the four bases for miraculous powers, the five powers, the five strengths, the seven aspects of enlightenment, and the noble eightfold path. They attain those thirty-seven aspects of enlightenment.
